Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source2.tmx
Source language: en_us
Languages: ja

source: Creates an integer from the given floating-point value, rounding toward zero.
ja: 与えられた浮動小数点値から整数を作成します、ゼロへの丸めを行います。

source: Creates an iterator that presents the elements of the sequences traversed by base, concatenated using separator.
ja: あるイテレータ、それはBaseによって辿っていかれるいくらかのシーケンスに属するいくらかの要素を、separatorを使って連結して提示します。

source: Creating a Buffer
ja: バッファの作成

source: Creating a New Collection
ja: 新しいコレクションの作成

source: Creating a Nil Value
ja: nil値の作成

source: Creating a Range
ja: 範囲を作成する

source: Creating a Result Publisher
ja: 結果パブリッシャーを作成する

source: Creating a Set
ja: 集合の作成

source: Creating a Value
ja: 値の作成

source: Creating an Iterator
ja: イテレータを作成する

source: Creating an Optional Publisher
ja: オプショナルパブリッシャーを作成する

source: Creating an Optional Value
ja: オプショナル値の作成

source: Creating and iterating over a Countdown sequence uses a CountdownIterator to handle the iteration.
ja: Countdownシーケンス全体にわたっての作成や反復は、その反復を取り扱うCountdownIteratorを使用します。

source: Customizing C APIs
ja: C APIのカスタマイズ

source: Customizing Objective-C APIs
ja: Objective-C APIをカスタマイズする

source: Customizing Your C Code for Swift
ja: あなたのCコードをSwift用にカスタマイズする

source: Customizing Your Type's Reflection
ja: あなたの型のリフレクションのカスタマイズ

source: Data Flow and Control Flow
ja: データの流れと制御の流れ

source: Debugging and Reflection
ja: デバッグとリフレクション

source: Declaration
ja: 宣言

source: Declare Closed Enumerations
ja: 完結列挙を宣言する

source: Declare Option Sets
ja: オプションセットを宣言する

source: Declare Simple Enumerations
ja: 単純な列挙を宣言する

source: Declare Typed Enumerations
ja: 型付き列挙を宣言する

source: Declare Typed Extensible Enumerations
ja: 型付き拡張可能列挙を宣言する

source: Declare a next() method that advances one step in the related sequence and returns the current element.
ja: next()メソッドを宣言してください、それは関連シーケンスにおいて一歩前へ進みます、そして現在の要素を返します。

source: Declare additional preconfigured option set values as static properties initialized with an array literal containing other option values.
ja: 追加のあらかじめ構成されるオプションセット値を、他のオプション値を含んでいる配列リテラルで初期化される静的プロパティとして宣言してください。

source: Declare simple macros as global constants, and translate complex macros into functions.
ja: 単純なマクロをグローバルな定数として宣言してください、そして複雑なマクロを関数へと翻訳してください。

source: Declaring Publisher Topography
ja: パブリッシャー地勢を宣言する

source: Declaring Publisher Topology
ja: パブリッシャー地勢を宣言する

source: Decoders should provide types conforming to UnkeyedDecodingContainer for their format.
ja: それらデコーダーは、それらの形式に対してUnkeyedDecodingContainerに準拠する型を提供すべきです。

source: Decodes a null value for the given key.
ja: 与えられたキーに対してnull値をデコードします。

source: Decodes a value of the given type for the given key, if present.
ja: 指定された型の値を与えられたキーに対してデコードします、もし存在するならば。

source: Decodes a value of the given type for the given key.
ja: 指定された型の値を与えられたキーに対してデコードします。

source: Decoding Containers
ja: デコーディングコンテナ

source: Decoding a Value
ja: 値をデコードする

source: Default Implementations
ja: 省略時実装

source: Default Literal Types
ja: 省略時のリテラル型

source: Denote instance (-) and class (+) methods with func and class func, respectively.
ja: インスタンス（-）およびクラス（+）メソッドであることを、それぞれfuncおよびclass funcで示してください。

source: Depending on the type, it may make sense to allocate more or less storage than requested or to take no action at all.
ja: 型によって、要請されたよりも多くまたは少なく割り当てるまたは全く行動を起こさないことが道理にかなっているかもしれません。

source: Depending on the type, it may make sense to allocate more or less storage than requested, or to take no action at all.
ja: 型によって、要請されたよりも多くまたは少なく割り当てること、または全く行動を起こさないことが道理にかなっているかもしれません。

source: Deprecated
ja: 非推奨

source: Describing a Range
ja: 範囲を記述する

source: Describing a Set
ja: あるSetの記述

source: Designating Nullability in Objective-C APIs
ja: Objective-C APIにおいてヌル可能性を指定する

source: Different keyed containers from the same Decoder may return different keys here; it is possible to encode with multiple key types which are not convertible to one another.
ja: 同じDecoderからの異なるキー付けコンテナは、異なるキーをここで返すかもしれません；互いに変換できないところの複数のキー型を使ってエンコードすることは可能です。

source: Different keyed containers from the same decoder may return different keys here, because it is possible to encode with multiple key types which are not convertible to one another.
ja: 同じデコーダからの異なるキー付けコンテナは、異なるキーをここで返すかもしれません、なぜなら互いに変換できないところの複数のキー型を使ってエンコードすることは可能だからです。

source: Digest Implementations
ja: 要約実装

source: Discussion
ja: 解説

source: Divides the first value by the second and stores the quotient in the left-hand-side variable.
ja: 最初の値を２番目の値で除算して、商を左手側の変数に格納します。

source: Divides the first value by the second and stores the remainder in the left-hand-side variable.
ja: 最初の値を２番目の値で除算して、余りを左手側の変数に格納します。

source: Dividing by zero is not an error when using this method.
ja: ゼロによる除算は、このメソッドを使う場合はエラーではありません。

source: Do not call this initializer directly.
ja: このイニシャライザを直接に呼ばないでください。

source: Do not declare new conformances to this protocol; they will not work as expected.
ja: 新しい準拠事項をこのプロトコルに宣言しないでください； それは期待するようには機能しないでしょう。

source: Do not rely on a previously stored index value after altering a collection with any operation that can change its length.
ja: あるコレクションをそれの長さを変える何らかの演算で手直し後に、以前に格納されたインデックス値を当てにしないでください。

source: Do not save hash values to use during a future execution.
ja: 将来の実行の間に使うためにハッシュ値を保存しないでください。

source: Doing so crashes your app:
ja: そうすることはあなたのアプリをクラッシュさせます：

source: Doing so may become a compile-time error in the future.
ja: そうすることは、コンパイル時エラーに将来はなるかもしれません。

source: Don't Put Critical Code in a Closure That Might Not Be Called
ja: 呼び出されないかもしれないクロージャの中に重大なコードを置かないでください

source: Don't Spread State Across Multiple Variables
ja: 状態を複数の変数に渡って広げないでください

source: Don't Write Code That Makes a One-Time Change in a Closure That's Called Multiple Times
ja: 一回限りの変更をするコードを複数回呼び出されるクロージャの中に書かないでください

source: Don't use the NS_CLOSED_ENUM macro if:
ja: NS_CLOSED_ENUMを使わないでください、もし：

source: Don’t actually use map for this purpose, however, because it creates and discards the resulting array.
ja: しかしながら、実際にmapをこの目的のために使わないでください、なぜならそれは結果の配列を作成してそして放棄するからです。

source: Don’t delete the .m and .h files immediately; use them to troubleshoot.
ja: .mと.hファイルを直ぐに削除しないでください；それらを不具合対処のために使ってください。

source: During instance creation, in particular during ManagedBuffer.create’s call to initialize, ManagedBuffer’s header property is as-yet uninitialized, and therefore reading the header property during ManagedBuffer.create is undefined.
ja: インスタンス作成の間、特にManagedBuffer.createでのイニシャライザ呼び出しの間、ManagedBufferのheaderプロパティは今の所まだイニシャライズされていません、そしてそれゆえheaderプロパティを読み出すことはManagedBuffer.createの間は未定義です。

source: Each bit of rawValue potentially represents an element of the option set, though raw values may include bits that are not defined as distinct values of the OptionSet type.
ja: rawValueの各ビットは、潜在的にオプションセットの１つの要素を表します、けれども生の値は他とまったく異なったOptionSet型の値として定義されないビットを含んでも構いません。

source: Each call to next() must produce a uniform and independent random value.
ja: next()への各呼び出しは、一様で独立した無作為値を生成しなければなりません。

source: Each integer argument selects the child at that offset.
ja: 各整数引数は、子をそのオフセットで選択します。

source: Each string argument requires a linear search, and unless the underlying collection supports random-access traversal, each integer argument also requires a linear operation.
ja: 各文字列引数は線形探索を要求します、そして基底コレクションがランダムアクセス走査をサポートしない限り、各整数引数もまた線形演算を要求します。

source: Each string argument selects the first child with a matching label.
ja: 各文字列引数は、合致するラベルを持つ最初の子を選択します。

source: Each time an element of the lazy sequence doubled is accessed, the closure accesses and transforms an element of the underlying array.
ja: この遅延シーケンスdoubledの要素がアクセスされるたびごとに、クロージャはその基礎をなす配列の要素にアクセスおよび変換します。

source: Each time the next() method is called on a CountdownIterator instance, it calculates the new next value, checks to see whether it has reached zero, and then returns either the number, or nil if the iterator is finished returning elements of the sequence.
ja: next()メソッドがCountdownIteratorインスタンス上で呼ばれるたびに、それは新しい次の値を計算し、それがゼロに届いたか見るために調べ、そしてそれからその数、またはそのイテレータがシーケンスの要素を返すことを完了するならばnilのどちらかを返します。

source: Effectively managing state, the bits of data that keep track of how the app is being used at the moment, is an important part of a developing your app.
ja: 効果的に状態、どのようにその時アプリが使われるかの情報を得る少量のデータ、を管理することは、あなたのアプリの開発の重要な部分です。

source: Elements are sorted in ascending order.
ja: 要素は昇順にソートされます。

source: Elements that are in only one or the other are left out of the result of the intersection.
ja: どちらか一方にだけある要素は、交叉の結果から除外されます。

source: Elements that are used to split the collection are not returned as part of any subsequence.
ja: コレクションを分割するのに使われる要素らは、どれかの下位シーケンスの一部として返されません。

source: Elements that are used to split the sequence are not returned as part of any subsequence.
ja: シーケンスを分割するのに使われる要素らは、どれかの下位シーケンスの一部として返されません。

source: Encoders should provide types conforming to KeyedEncodingContainerProtocol for their format.
ja: それらエンコーダは、それらの形式に対してKeyedEncodingContainerProtocolに準拠する型を提供すべきです。

source: Encodes a null value for the given key.
ja: 与えられたキーに対してnull値をエンコードします。

source: Encodes a reference to the given object only if it is encoded unconditionally elsewhere in the payload (previously, or in the future).
ja: 与えられたオブジェクトへの参照をエンコードします、それがそのペイロードの中のどこか他の所で無条件にエンコードをされる（以前に、またはこの先に）場合に限ります。

source: Encodes the elements of this set into the given encoder in an unkeyed container.
ja: この集合の要素を指定されたエンコーダへとあるキー付けされないコンテナにおいてエンコードします。

source: Encodes the given value for the given key if it is not nil.
ja: 与えられたキーに対して与えられた値をエンコードします、それがnilでないならば。

source: Encodes the given value for the given key.
ja: 与えられたキーに対して与えられた値をエンコードします。

source: Encodes the scalars of this vector into the given encoder in an unkeyed container.
ja: このベクターのスカラーそれらをこの与えられたエンコーダへとキー付けされないコンテナの中に符号化します。

source: Encodes this optional value into the given encoder.
ja: このオプショナル値を与えられたエンコーダにエンコードします。

source: Encodes this value into the given encoder, when the type’s RawValue is Bool.
ja: この値をその与えられたデコーダへとデコードします、その型のもつRawValueがBoolである場合。

source: Encodes this value into the given encoder, when the type’s RawValue is Double.
ja: この値をその与えられたデコーダへとデコードします、その型のもつRawValueがDoubleである場合。

source: Encodes this value into the given encoder, when the type’s RawValue is Float.
ja: この値をその与えられたデコーダへとデコードします、その型のもつRawValueがFloatである場合。

source: Encodes this value into the given encoder, when the type’s RawValue is Int16.
ja: この値をその与えられたデコーダへとデコードします、その型のもつRawValueがInt16である場合。

source: Encodes this value into the given encoder, when the type’s RawValue is Int32.
ja: この値をその与えられたデコーダへとデコードします、その型のもつRawValueがInt32である場合。

source: Encodes this value into the given encoder, when the type’s RawValue is Int64.
ja: この値をその与えられたデコーダへとデコードします、その型のもつRawValueがInt64である場合。

source: Encodes this value into the given encoder, when the type’s RawValue is Int8.
ja: この値をその与えられたデコーダへとデコードします、その型のもつRawValueがInt8である場合。

source: Encodes this value into the given encoder, when the type’s RawValue is Int.
ja: この値をその与えられたデコーダへとデコードします、その型のもつRawValueがIntである場合。

source: Encodes this value into the given encoder, when the type’s RawValue is String.
ja: この値をその与えられたデコーダへとデコードします、その型のもつRawValueがStringである場合。

source: Encodes this value into the given encoder, when the type’s RawValue is UInt16.
ja: この値をその与えられたデコーダへとデコードします、その型のもつRawValueがUInt16である場合。

source: Encodes this value into the given encoder, when the type’s RawValue is UInt32.
ja: この値をその与えられたデコーダへとデコードします、その型のもつRawValueがUInt32である場合。

source: Encodes this value into the given encoder, when the type’s RawValue is UInt64.
ja: この値をその与えられたデコーダへとデコードします、その型のもつRawValueがUInt64である場合。

source: Encodes this value into the given encoder, when the type’s RawValue is UInt8.
ja: この値をその与えられたデコーダへとデコードします、その型のもつRawValueがUInt8である場合。

source: Encodes this value into the given encoder, when the type’s RawValue is UInt.
ja: この値をその与えられたデコーダへとデコードします、その型のもつRawValueがUIntである場合。

source: Encodes this value into the given encoder.
ja: この値を与えられたエンコーダにエンコードします。

source: Encoding Containers
ja: エンコーディングコンテナ

source: Encoding a Value
ja: 値をエンコードする

source: Encoding and Decoding
ja: エンコーディングとデコーディング

source: Encoding and Decoding a Range
ja: ある範囲を符号化そして復号する

source: Encoding, Decoding, and Serialization
ja: エンコード、デコード、そしてシリアライズ

source: Enumeration Case
ja: 列挙ケース

source: Enumeration Cases
ja: 列挙ケース

source: Enumerations
ja: 列挙

source: Enumerations imported using the NS_ENUM macro won't fail when you initialize one with a raw value that does not correspond to an enumeration case.
ja: NS_ENUMマクロを使ってインポートされる列挙は、あなたが列挙ケース節に一致しない生の値を持つものを初期化する場合に、失敗しません。

source: Enumerations with Raw Values
ja: 生の値を持つ列挙

source: Equality is the inverse of inequality.
ja: 同等性は、不等性の裏返しです。

source: Equivalent to indices.reduce(into: 0) { $0 &+= self[$1] }.
ja: indices.reduce(into: 0) { $0 &+= self[$1] }に等しい。

source: Equivalent to calling superDecoder(forKey:) with Key(stringValue: "super", intValue: 0).
ja: superDecoder(forKey:) with Key(stringValue: "super", intValue: 0)を呼び出すことと同等です。

source: Equivalent to calling superEncoder(forKey:) with Key(stringValue: "super", intValue: 0).
ja: superEncoder(forKey:) with Key(stringValue: "super", intValue: 0)を呼び出すことと同等です。

source: Equivalent to:
ja: 次に等しい：

source: Errors
ja: エラー

source: Evaluates the given closure when this Optional instance is not nil, passing the unwrapped value as a parameter.
ja: 与えられたクロージャをこのOptionalインスタンスがnilでない場合に評価します、アンラップされた値をパラメータとして渡しています。

source: Even something as simple as printing a sequence of letters can be affected by the timing of a closure call:
ja: 一連の文字を印字するような単純なことでさえ、クロージャ呼び出しの時機によって影響される可能性があります：

source: Even though the line that prints A is first in the code, it's ordered later in the output.
ja: たとえAを印字する行がコードにおいて最初であっても、それは出力においてもっと後の順番にされます。

source: Every distinct value of the conforming type has a corresponding unique value of the RawValue type, but there may be values of the RawValue type that don’t have a corresponding value of the conforming type.
ja: 準拠する型のすべての個々の値は、RawValue型の対応する特有な値を持ちます、しかし準拠する型の値に対応しないRawValue型の値があっても構いません。

source: Every element of numbers up to, but not including, the first negative value is included in the result.
ja: 最初の負の値までの、しかしそれを含まない、numbersのすべての要素は、この結果の中に含まれます。

source: Every value in the range 0..Bound is equally likely to be returned.
ja: 範囲0..Boundの中の全ての値は、等しく返される可能性をもちます。

source: Everything from your implementation and interface goes directly into this single Swift file.
ja: あなたの実装とインタフェースからのすべては、直接この単一のスウィフトファイルに入ります。

source: Example Buffer Class
ja: バッファクラスの例

source: Exchanges the values at the specified indices of the collection.
ja: そのコレクションの指定インデックスでの値を交換します。

source: Excluding Elements
ja: 要素を除外する

source: Execute the given body closure on the main actor.
ja: 与えられたbodyクロージャを主アクター上で遂行します。

source: Exiting a Program
ja: プログラムの終了

source: Expected Performance
ja: 期待される性能

source: Expose the Existing Implementation
ja: 既存の実装を公開する

source: Extensible enumerations are imported in a similar fashion to nonextensible ones, except that they receive an additional initializer.
ja: 拡張可能列挙は、それらが追加的なイニシャライザを受け取ることを除いては、同じようなやり方で拡張可能でないものにインポートされます。

source: Extracts the scalars at specified indices to form a SIMD16.
ja: 形式SIMD16への指定インデックスそれらでのスカラーを抽出します。

source: Extracts the scalars at specified indices to form a SIMD2.
ja: 形式SIMD2への指定インデックスそれらでのスカラーを抽出します。

source: Extracts the scalars at specified indices to form a SIMD3.
ja: 形式SIMD3への指定インデックスそれらでのスカラーを抽出します。

source: Extracts the scalars at specified indices to form a SIMD32.
ja: 形式SIMD32への指定インデックスそれらでのスカラーを抽出します。

source: Extracts the scalars at specified indices to form a SIMD4.
ja: 形式SIMD4への指定インデックスそれらでのスカラーを抽出します。

source: Extracts the scalars at specified indices to form a SIMD64.
ja: 形式SIMD64への指定インデックスそれらでのスカラーを抽出します。

source: Extracts the scalars at specified indices to form a SIMD8.
ja: 形式SIMD8への指定インデックスそれらでのスカラーを抽出します。

source: Fill out an Objective-C bridging header if you need to access Objective-C code from the same app target in your Swift file.
ja: Objective-Cブリッジヘッダを記入してください、もしあなたがObjective-CコードにあなたのSwiftファイルにおいて同じアプリターゲットからアクセスする必要があるならば。

source: Finally, you can give all lazy sequences a lazy scan(_:_:) method:
ja: 最終的に、あなたは全ての遅延シーケンスをある遅延scan(_:_:)メソッドに与えることができます：

source: Finding Elements
ja: 要素を見つける

source: First Steps
ja: 初歩

source: First, retrieve a sequence’s iterator, and then call the iterator’s next() method until it returns nil.
ja: まず、あるシーケンスのもつイテレータを見つけて取ってきてください、そしてそのイテレータの持つnext()メソッドを、それがnilを返すまで呼び出してください。

source: First, the function finds the position of the last even number as a ReversedIndex in a reversed view of the array of numbers.
ja: 最初に、この関数は最後の偶数の位置を、数からなる配列の逆にされたビューにおけるReversedIndexとして捜します。

source: For a value x, a distance n, and a value y = x.advanced(by: n), x.distance(to: y) == n.
ja: 値x、隔たりn、および値y = x.advanced(by: n)に対して、x.distance(to: y) == n。

source: For a value x, the result of x.dividedReportingOverflow(by: 0) is (x, true).
ja: 値xに対して、x.dividedReportingOverflow(by: 0)の結果は(x, true)です。

source: For a value x, the result of x.remainderReportingOverflow(dividingBy: 0) is (x, true).
ja: 値xに対して、x.remainderReportingOverflow(dividingBy: 0)の結果は(x, true)です。

source: For all other kinds of declaration—such as properties, enumeration cases, and type aliases—you use the macro as a suffix.
ja: 全ての他の種類の宣言に対して — 例えばプロパティ、列挙ケース節、そして型エイリアスなど — あなたはこのマクロを接尾辞として使います。

source: For an example of how Swift imports unannotated declarations, consider the following code:
ja: どのようにSwiftが注釈を付けられない宣言をインポートするかの例として、以下のコードを考慮してください：

source: For an index i into a collection c, calling c.index(after: i) returns the same index every time.
ja: コレクションcへのインデックスiに対して、c.index(after: i)を呼び出すことはいつでも同じインデックスを返します。

source: For any enumeration with a string, integer, or floating-point raw type, the Swift compiler automatically adds RawRepresentable conformance.
ja: 文字列、整数、または浮動小数点の生の型を持つ何らかの列挙に対して、Swiftコンパイラは自動的にRawRepresentable準拠を加えます。

source: For any numeric value x, x.magnitude is the absolute value of x.
ja: 何らかの数値xに対して、x.magnitudeはxの絶対値です。

source: For any two integers a and b, their quotient q, and their remainder r, a == b * q + r.
ja: 何らかの２つの整数aとb、それらの商q、そしてそれらの余りrに対して、a == b * q + r。

source: For any value, x + .zero == x and .zero + x == x.
ja: あらゆる値に対して、x + .zero == xかつ.zero + x == x。

source: For any values a and b, a != b implies that a == b is false.
ja: 何らかのaとbに対して、a != bはa == bがfalseであることを意味します。

source: For any values a and b, a == b implies that a != b is false.
ja: 何らかの値aとbに対して、a == bはa != bがfalseであることを意味します。

source: For bridging to be possible, the Element type of a set must be a class, an @objc protocol (a protocol imported from Objective-C or marked with the @objc attribute), or a type that bridges to a Foundation type.
ja: ブリッジが可能にされるには、集合のElement型は、クラス、@objcプロトコル（Objective-Cからインポートされるまたは@objc属性で印されるプロトコル）、またはあるFoundation型にブリッジする型でなければなりません。

source: For clearer, more concise code, the example above could use the array’s contains(_:) method, which every sequence inherits from Sequence, instead of iterating manually:
ja: より明確な、もっと簡潔なコードのために、上のコードは、すべてのシーケンスがSequenceから継承する、配列のもつcontains(_:)メソッドを使うことが、労力を要する反復の代わりに可能です：

source: For collections that don’t conform to RandomAccessCollection, accessing the count property iterates through the elements of the collection.
ja: RandomAccessCollectionに準拠しないコレクションに対して、countプロパティにアクセスすることはコレクションの要素を始めから終わりまで反復します。

source: For detailed information about specifying platform availability, see Declaration Attributes in The Swift Programming Language.
ja: プラットホーム利用可能性の指定についての詳細な情報として、宣言属性をThe Swift Programming Languageで見てください。

source: For encoders which don’t support this feature, the default implementation encodes the given object unconditionally.
ja: この機能をサポートしないエンコーダに対して、省略時の実装は与えられたオブジェクトを無条件にエンコードします。

source: For every change in state, you need to provides updates for both user and sessionExpired in tandem.
ja: 状態におけるすべての変化に対して、あなたはuserとsessionExpiredの両方に対して相前後して更新を提供する必要があります。

source: For example,
ja: 例えば、

source: For example, doubled in this code sample is a sequence containing the values 2, 4, and 6.
ja: 例えば、このコード見本の中のdoubledは、値2、4、そして6を含んでいるあるシーケンスです。

source: For example, 6 is a multiple of 3 because 6 = 2*3.
ja: 例えば、6は3の倍数です、なぜなら6 = 2*3なので。

source: For example, a random-access collection’s count property is calculated in O(1) instead of requiring iteration of an entire collection.
ja: 例えば、無作為アクセスコレクションのもつcountプロパティは、コレクション全体の反復を要求したりせずにO(1)で計算されます。

source: For example, a seedable generator can be used to generate a repeatable sequence of random values for testing purposes.
ja: 例えば、シード可能生成子は、繰り返し可能な一連の無作為値を、テスト目的で生成するために使用できます。

source: For example, after filtering a set of prime numbers to remove any below 10, you can create a new set by using this initializer.
ja: 例えば、ひとそろいの素数をフィルタして10の前のどんなものも削除した後で、あなたは新しい集合をこのイニシャライザを使って作成できます。

source: For example, an eager scan(_:_:) method is defined as follows:
ja: 例えば、ある即時scan(_:_:)メソッドは以下のように定義されます：

source: For example, consider a custom Countdown sequence.
ja: 例えば、あるあつらえのCountdownシーケンスを考えてください。

source: For example, consider a custom type called ShippingOptions that is an option set of the possible ways to ship a customer’s purchase.
ja: 例えば、ShippingOptionsと呼ばれるあつらえの型を考えてください、それは顧客の購入品を出荷する可能な方法のオプションセットです。

source: For example, for a variable root of type T, a key path key of type WritableKeyPath<T, U>, and a value of type U:
ja: 例えば、変数rootで型T、キーパスkeyで型WritableKeyPath<T, U>、そしてvalueで型Uに対して：

source: For example, if a variable has the type Int?, that’s just another way of writing Optional<Int>.
ja: 例えば、ある変数が型Int?を持つとすれば、それはOptional<Int>を記述することのありきたりのやり方です。

source: For example, if there are parts of your codebase to which you haven't added nullability annotations, now's the time to add them.
ja: 例えば、ヌル可能性注釈を加えてないなあなたのコード基盤の部分があるならば、今こそそれらを加える時です。

source: For example, in a fixed-width integer type with a bitWidth value of 8, the number 31 has five bits equal to 1.
ja: 例えば、８のbitWidth値を持つ固定長整数型において、数31は1に等しいビットを５つ持ちます。

source: For example, in an integer type with a bitWidth value of 8, the number 31 has three leading zeros.
ja: 例えば、８のbitWidth値を持つ整数型において、数31は３つの先頭のゼロを持ちます。

source: For example, in the ProductCategory type defined here, only \.updateCounter, \.identifier, and \.identifier.name refer to properties with inline, directly addressable storage:
ja: 例えば、ここで定義されるProductCategory型において、\.updateCounter, \.identifier、そして\.identifier.nameだけがインラインに、直接にアドレス指定可能なストレージでのプロパティを参照します。

source: For example, iterating over an instance of PartialRangeFrom<Int> traps when the sequence’s next value would be above Int.max.
ja: 例えば、PartialRangeFrom<Int>のインスタンスの全体にわたって反復することは、そのシーケンスの次の値がInt.maxより上となる場合にトラップします。

source: For example, passing 1, "two", 3 as arguments to myMirror.descendant(_:_:) is equivalent to:
ja: 例えば、1, "two", 3を引数としてmyMirror.descendant(_:_:)に渡すことは、次と同等です：

source: For example, passing a closed range with an upper bound of Int.max triggers a runtime error, because the resulting half-open range would require an upper bound of Int.max + 1, which is not representable as
ja: 例えば、完結範囲をInt.maxの上方境界で渡すことは実行時エラーの引き金となります、なぜなら結果の半開範囲はInt.max + 1の上方境界を要求するからです。それはのように表されることができません

source: For example, the Counter enumeration defined here has an Int raw value type and gives the first case a raw value of 1:
ja: 例えば、ここで定義されるCounter列挙は、Intの生の値型を持ち、そして最初のケース節に生の値の1を与えます：

source: For example, the contains() method on allowedMoves performs a bitwise AND operation to check whether the option set contains an element.
ja: 例えば、contains()メソドはallowedMoves上で、ビット単位AND演算を実行して、オプションセットがある要素を含むかどうか調べます。

source: For example, the later(_:) method above is comparable to the URLSession class's dataTask(with:completionHandler:) method, which is also asynchronous.
ja: 例えば、上のlater(_:)メソッドは、URLSessionクラスのdataTask(with:completionHandler:)メソッドと似ています、それもまた非同期です。
